

#include <stc12c5a.h>//包含头文件
#include"y452.h"

unsigned char code th[] = {//定时器0高八位频率设定
0x27,0xE2,0xE4,0xE6,0xE7,0xE8,0xEA,0xEB,0xEC,0xED,0xEE,0xEF,0xF0,0xF1,
//低八度0,b1,1,#1,2,#2,3,4,#4,5,#5,6,#6,7
0xF2,0xF3,0xF3,0xF4,0xF5,0xF5,0xF6,0xF6,0xF7,0xF7,0xF8,0xF8,
//中音1,#1,2,#2,3,4,#4,5,#5,6,#6,7
0xF9,0xF9,0xF9,0xFA,0xFA,0xFA,0xFB,0xFB,0xFB,0xFB,0xFC,0xFC,0xFC
//高八度1,#1,2,#2,3,4,#4,5,#5,6,#6,7,#7
};
unsigned char code tl[] = {//定时器0低八位频率设定
0xFF,0xD9,0x84,0x19,0x82,0xEB,0x2E,0x5E,0x97,0xA1,0xB0,0xA2,0x94,0x6C,
//低八度0,b1,1,#1,2,#2,3,4,#4,5,#5,6,#6,7
0x3B,0x06,0xBB,0x70,0x12,0xAE,0x48,0xD0,0x58,0xD0,0x4A,0xB5,
//中音1,#1,2,#2,3,4,#4,5,#5,6,#6,7
0x1F,0x84,0xDE,0x39,0x8A,0xD8,0x24,0x67,0xAB,0xE8,0x22,0x56,0x8C
//高八度1,#1,2,#2,3,4,#4,5,#5,6,#6,7,#7
};
unsigned char code ysjs[] = {//延时计算一个单位时间为0.021s
1,6,7,7,7,8,8,9,9,10,10,11,12,12,
//低八度0,b1,1,#1,2,#2,3,4,#4,5,#5,6,#6,7
13,14,15,16,17,18,19,20,21,22,24,25,
//中音1,#1,2,#2,3,4,#4,5,#5,6,#6,7
26,28,30,31,33,35,37,40,42,44,47,50,53
//高八度1,#1,2,#2,3,4,#4,5,#5,6,#6,7,#7
};
unsigned char code jpsz[] = {2,4,5,7,11,13,15,24,28,32,49,66};//对应节拍数组

unsigned char code yb1[][2] = {//歌曲音符节拍调用数组
{9,3},{16,3},{18,3},{0,3},{0,6},{0,6},{18,3},{9,3},{6,6},{14,6},{16,3},{18,3},{21,3},{23,4},{21,1},{21,3},{16,6},{9,3},{16,3},{18,3},{18,3},{6,3},{11,3},{14,3},{16,3},{18,3},{26,3},{25,6},{26,3},{25,6},{21,3},{21,1},{14,1},{23,1},{21,1},{23,3},{11,3},{14,3},{11,3},{19,3},{18,3},{19,3},{26,3}
};

void ds1()
{
    TMOD |= 0x11;//打开定时器0，工作模式为1
    TR0=1;//定时器0开关打开
    EA=1;//总中断打开
    ET0=1;//定时器0中断打开
}

void ds0_d0()interrupt 1//当定时器0溢出中断
{
    TH0 = th[yb1[bf][0]];//定时器0高8位给定时值
    TL0 = tl[yb1[bf][0]];//定时器0低8位给定时值
    if (th[yb1[bf][0]] != 0x27 && tl[yb1[bf][0]] != 0xFF)
{//当没有播放到休止符0
    fmq = ~fmq;//蜂鸣器振动发声
}
    jp0++;//计数器加一计数
if (jp0 == ysjs[yb1[bf][0]])
{//如果当前音符播放了0.03s
    jp1++;//节拍,播放个数加1
    jp0 = 0;//计数器归零
}
if (jp1 == jpsz[yb1[bf][1]])
{//如果当前音符播放完成一个指定的节拍
    bf++;//播放位置跳到下一个音符节拍
    jp1 = 0;//计数器归零
if(bf == 43)
{//如果播放到最后一位，即播放完成
    bf = 0;//从头播放
  }
  }
}